namespace Bdz.LocalDB
{
    using SQLite;
    using System;
    using System.Collections.Generic;
    using System.Diagnostics;
    using System.Text;
    using System.Threading.Tasks;
    using Windows.Storage;

    public sealed class LocalDBManager
    {
        private static readonly LocalDBManager manager = new LocalDBManager();
        private  SQLiteAsyncConnection db;
        private List<string> towns =
            new List<string>() {"АБЛАНИЦА","АВРАМОВО","АЙТОС","АЛ.ДИМИТРОВ","АЛДОМИРОВЦИ","АЛЕКСАНДРОВО","АЛФАТАР","АНЕВО",
                                "АНТОН","АРКОВНА","АСЕНОВГРАД","АСЕНОВО", "АСЕНОВЦИ","АСПАРУХОВО","АТОЛОВО", "БАЙКОВО",
                                "БАЛКАН","БАНКОВИЦА","БАНКЯ","БАНСКО","БАНЯ","БАТАНОВЦИ","БАТИШНИЦА","БАЧО КИРО","БЕЗИМЕННА",
                                "БЕЗМЕР","БЕЛА ВОДА","БЕЛИ ИЗВОР","БЕЛИЦА","БЕЛОВО","БЕЛОЗЕМ","БЕЛОСЛАВ","БЕЛЩИЦА","БЕНКОВСКИ",
                                "БЕРКОВИЦА","БИСЕР","БЛ.ЗАХАРИЕВ","БЛАГОВО","БЛАГОЕВГРАД","БЛАГОЕВГРАД - СП.","БОБОВ ДОЛ",
                                "БОБОШЕВО","БОВ","БОГДАНЦИ","БОЖИЧЕН","БОЖКОВЦИ","БОЖУРИЦА","БОЖУРИЩЕ","БОЗАДЖИ","БОЙКА",
                                "БОЙЧИНОВЦИ","БОКИЛОВЦИ","БОРОВО","БОРОВЦИ","БОРУЩИЦА","БОРЯНА","БОТЕВ","БОТЕВО","БОТУНЕЦ",
                                "БРАЦИГОВО","БРИГАДИР","БРИГАДИРСКА СЛАВА","БРУСАРЦИ","БРУСЕН","БРЪМЧА","БРЯСТ","БУНОВО",
                                "БУРГАС","БУРГАС-РАЗПРЕДЕЛИТЕЛНА","БУРГАС-РАЗПРЕДЕЛИТЕЛНА-СПИРКА","БУРГАС-ТОВАРНА","БУТОВО",
                                "БЪЗОВЕЦ","БЪЛГАРОВО","БЪРДОКВА","БЯГА","БЯЛ БРЯГ","БЯЛА","БЯЛО ПОЛЕ", "ВАКАРЕЛ","ВАКАРЕЛ - СП.",
                                "ВАРВАРА","ВАРНА","ВАРНА - СП.","ВАСИЛ ЛЕВСКИ","ВАСИЛОВЦИ","ВЕДРОВО","ВЕЛИКО ТЪРНОВО","ВЕЛИНГРАД",
                                "ВЕЛИНГРАД ЮГ","ВЕЛИНО","ВЕЛИЧКОВО","ВЕНЧАН","ВЕРИЛА","ВЕРИНСКО","ВЕТОВО","ВЕТРЕН","ВИДБОЛ","ВИДИН",
                                "ВИНИЦА","ВИСОКА ПОЛЯНА","ВЛАДАЯ","ВЛАДИМИР ПАВЛОВ","ВЛАДО ТРИЧКОВ","ВЛАСАТИЦА","ВОДНЯНЦИ","ВОЛУЯК",
                                "ВР.ДЕПО ПЛОВДИВ-СП.","ВРАЦА","ВРАЦА - СПИРКА","ВРЪБНИЦА","ВЪБЕЛ","ВЪЛЧИ ДОЛ","ВЪЛЧИН", "Г.ОРЯХОВИЦА-ПР.ПАРК",
                                "ГАБАРЕВО","ГАБРОВНИЦА","ГАБРОВО","ГАВРАИЛОВО","ГАНЧОВЕЦ","ГЕНЕРАЛ КИСЕЛОВО","ГЕНЕРАЛ КОВАЧЕВ","ГЕНЕРАЛ КОЛЕВО",
                                "ГЕНЕРАЛ ТОДОРОВ","ГЕНЕРАЛ ТОШЕВО","ГЛУМЧЕ","ГЛУХАР","ГОЛЯМ ПОРОВЕЦ","ГОЛЯМА ВОДА","ГОЛЯМО ДРЯНОВО",
                                "ГОЛЯМО НОВО","ГОЛЯМО СЕЛО","ГОРИЦА","ГОРНА БАНЯ","ГОРНА КРЕТА","ГОРНА МАЛИНА","ГОРНА МАХАЛА","ГОРНА ОРЯХОВИЦА",
                                "ГОРНА ОРЯХОВИЦА-РАЗПР.П.","ГОРНИ ДЪБНИК","ГОРНО БОТЕВО","ГОРСКО ДЮЛЕВО","ГРАДЕШНИЦА","ГРАДИЩЕ",
                                "ГРАФ ИГНАТИЕВО","ГРИВИЦА","ГУЛИЙНА БАНЯ","ГУРКОВО","ГЪЛЪБНИК","ГЮЕШЕВО","ДАГОНОВО","ДАМЯНИЦА",
                                "ДАСКАЛОВО","ДВЕ МОГИЛИ","ДЕБЕЛЕЦ","ДЕБЕЛИ ЛАК","ДЕВНЯ","ДЕЛЯН","ДЖЕБЕЛ","ДЖЕРМАН","ДЖУЛЮНИЦА",
                                "ДИБИЧ","ДИВДЯДОВО","ДИМИТОВГРАД ЮГ СП.","ДИМИТРИЕВО","ДИМИТРОВГРАД","ДИМИТРОВГРАД СЕВЕР","ДИМОВО",
                                "ДОБРИНА","ДОБРИНИЩЕ","ДОБРИНОВО","ДОБРИЧ","ДОБРИЧ - СЕВЕР","ДОБРОДАН","ДОЖДЕВИЦА","ДОЙРЕНЦИ",
                                "ДОЛАПИТЕ","ДОЛЕНЕ","ДОЛНА МАХАЛА","ДОЛНА МИТРОПОЛИЯ","ДОЛНИ ВИТ","ДОЛНИ ДЪБНИК","ДОЛНИ РАКОВЕЦ",
                                "ДОЛНО ЕЗЕРОВО","ДОЛНО КАМАРЦИ","ДОЛНО СЕЛО","ДОЛНО ЦЕРОВЕНЕ","ДОНЧЕВО","ДРАГИЧЕВО","ДРАГОМАН",
                                "ДРАГОМАН - СП.","ДРАГОМИРОВО","ДРАЛФА","ДРАСОВ","ДРЕНОВЕЦ","ДРОПЛА-СПИРКА","ДРУЖБА","ДРЯНОВО",
                                "ДРЯНОВО - СП.","ДУЛОВО","ДУНАВЦИ","ДУПНИЦА","ДУПНИЦА - СП.","ДЪБЕНЕ","ДЪБОВА МАХАЛА","ДЪБОВО",
                                "ДЪЛГА ЛЪКА","ДЪЛГОПОЛ","ДЪСКОТНА","ДЮЛЕВО","ДЯКОВО", "ЕГЪЛНИЦА","ЕЗЕРОВО","ЕЗЕРОВО-СПИРКА",
                                "ЕЛЕНИНО","ЕЛИН ПЕЛИН","ЕЛИСЕЙНА","ЕЛИТ","ЕРДЕН", "ЖАБЛЯНО","ЖЕГЛИЦА","ЖЕЛЕЗНИЦА","ЖЕЛЕН","ЖЕЛЪД",
                                "ЖЕЛЮ ВОЙВОДА","ЖЕЛЯЗНА ВРАТА","ЖИВКОВО","ЖИТНИЦА","ЖП.ШКОЛА - ЛАКАТНИК", "ЗАВЕТ","ЗАВЕТ - СП.",
                                "ЗАВОЙ - СП.","ЗАХАРНА ФАБРИКА","ЗВЕЗДЕЛИНА","ЗВЕРИНО","ЗВЪНИЧЕВО","ЗДРАВЕЦ","ЗЕМЕН","ЗИМНИЦА",
                                "ЗЛАТИЦА","ЗЛАТНА НИВА","ЗЛАТУША","ЗМЕЙОВО", "ИВАН ВАЗОВО","ИВАНКОВЦИ","ИВАНОВО","ИВАНСКИ","ИВАНЯНЕ",
                                "ИГАНОВО","ИЛИЯНЦИ","ИСКЪР","ИСПЕРИХ","ИХТИМАН","ЙОГЛАВ","КАДИЕВО","КАЗАНЛЪК","КАЗАЧЕВО","КАЗИЧЕНЕ",
                                "КАЛЕЙЦА","КАЛИПЕТРОВО","КАЛИТИНОВО","КАЛИЩА","КАЛОТИНА-ЗАПАД","КАЛОФЕР","КАЛОЯНОВЕЦ","КАЛОЯНОВО",
                                "КАЛОЯНЦИ","КАЛУГЕРИЦА","КАМЕНЕЦ","КАМЕННИ КАРИЕРИ","КАМЕНО","КАМЕНЯК","КАРАВЕЛЬОВО","КАРАГЕОРГИЕВО",
                                "КАРАДЖАЛОВО","КАРАДЖАТА","КАРБИНЦИ","КАРДАМ","КАРИЕРА-СКАКАВИЦА","КАРЛОВО","КАРЛУКОВО","КАРНОБАТ",
                                "КАСПИЧАН","КАТУНИЦА","КЕРМЕН","КЕСАРЕВО","КИПРА","КИТАНЧЕВО","КЛИКАЧ","КЛИМАТ.УЧИЛИЩЕ","КЛИМАШ",
                                "КЛИСУРА","КНИЖОВНИК","КОВАЧЕВО","КОЗАРЕВЕЦ","КОЗАРСКО","КОМАРЕВО","КОМУНАРИ","КОНАРЕ","КОНДОФРЕЙ",
                                "КОНСТАНТИНОВО","КОНЬОВО","КОПАНИЦА","КОПИЛОВЦИ","КОПРИВЩИЦА","КОСТА ПЕТРОВ","КОСТАНДОВО","КОСТЕНЕЦ",
                                "КОСТИНБРОД","КОСТИНБРОД - СП.","КОЧЕВО","КОЧЕРИНОВО","КОЧОВО","КОШАРИТЕ","КОШОВ","КРАКРА","КРЕМИКОВЦИ",
                                "КРЕПОСТ","КРЕСНА","КРЕСНА - СП.","КРЕТА","КРИВА БАРА","КРИВНЯ","КРИВОДОЛ","КРИЧИМ","КРУМ","КРУМОВО",
                                "КРУШЕТО","КРЪСТЕЦ","КУБРАТОВО","КУЛАТА","КУМАРИЦА","КУНИНО","КУРИЛО","КУРТОВО КОНАРЕ","КУТУГЕРЦИ",
                                "КУЦИНА","КЪРДЖАЛИ","КЪРНАРЕ","КЪРШАЛЕВО","КЮСТЕНДИЛ","ЛАКАТНИК","ЛЕВИЩЕ","ЛЕВСКИ","ЛЕСИЧЕРИ","ЛЕСКА",
                                "ЛЕТНИЦА","ЛЕШНИЦА","ЛИСТЕЦ","ЛОВЕЦ","ЛОВЕЧ","ЛОВЕЧ - СП.","ЛОВЕЧ - ЮГ","ЛОВЕЧ-СЕВЕР","ЛОЗАРЕВО",
                                "ЛОЗОВО-СПИРКА","ЛОКОРСКО","ЛОМ","ЛОМЕЦ","ЛУКОВО","ЛЮБИМЕЦ","ЛЮЛЯКОВО","ЛЮТИБРОД","МАВРУДОВО","МАДАРА",
                                "МАЗАРАЧЕВО","МАКОЦЕВО","МАКОЦЕВО - СП.","МАКРЕШ","МАЛЕВО","МАЛО СЕЛО","МАНОЛЕ","МАНОЛОВО","МАРЕК",
                                "МАРИКОСТИНО","МАРИНО ПОЛЕ","МАРКО НИКОЛОВ","МАСЛИНОВО","МЕДКОВЕЦ","МЕДОВИНА","МЕЖДЕН","МЕЗДРА",
                                "МЕЗДРА ЮГ","МЕРИЧЛЕРИ","МЕРИЧЛЕРИ-СП.","МЕТАЛ-СП.","МИЛКОВИЦА","МИРКОВО","МИРКОВО - СП.","МИХАЙЛОВО",
                                "МИХАЛЦИ-СТАМБОЛОВО","МЛАМОЛОВО","МОКРИЩЕ","МОМИН БРОД","МОМИН ПРОХОД","МОМИНА КЛИСУРА","МОМИНА СКАЛА",
                                "МОМЧИЛГРАД","МОНТАНА","МОРАВА","МОРАВИЦА","МОРУНИЦА","МОРЯК","МОСТ","МУЛЕТАРОВО","МУРСАЛЕВО","МУСАЧЕВО",
                                "МЪДРЕЦ","МЪРЧЕВО","МЪТНИЦА","НАДАРЕВО","НАДЕЖДА - СП.","НЕВЕСТИНО","НЕВША","НЕГОВАН","НЕГУШЕВО",
                                "НЕМИРОВО","НИКОЛАЕВО","НОВА ЗАГОРА","НОВА НАДЕЖДА","НОВА ШИПКА","ОБЕДИНЕНА","ОБЕЛЯ","ОБОРИЩЕ","ОБРАЗЦОВ ЧИФЛИК",
                                "ОВЧЕПОЛЦИ","ОГНЯНОВО","ОДЪРНЕ","ОПЛЕТНЯ","ОПЪЛЧЕНЕЦ","ОРЕШ","ОРЕШАК","ОРЕШЕЦ","ОРИЗОВО","ОРЛИН","ОСЕЛНА",
                                "ОСЕТЕНОВО","ОСЛЕН","ОСТРЕЦ","ОТДИХ","ОХРИД","ПАВЕЛ БАНЯ","ПАВЛИКЕНИ","ПАЗАРДЖИК","ПАЛИ ЛУЛА","ПАМПОРОВО - СП.",
                                "ПАНАГЮРИЩЕ","ПАРТИЗАНИ","ПЕРНИК","ПЕРНИК РАЗПРЕДЕЛИТ.","ПЕРПЕРЕК","ПЕСНОПОЙ","ПЕТКО КАРАВЕЛОВО",
                                "ПЕТРИЧ","ПЕТЪРЧ","ПЕЩЕРА","ПЕЮ ЯВОРОВ","ПИРДОП","ПЛАЧКОВЦИ","ПЛЕВЕН","ПЛЕВЕН ЗАПАД","ПЛИСКА","ПЛОВДИВ",
                                "ПЛОСКА МОГИЛА","ПОБИТ КАМЪК","ПОВЕЛЯНОВО","ПОДВИС","ПОДГОРИЦА","ПОДЕМ","ПОДКОВА","ПОДУЯНЕ ПЪТНИЧЕСКА",
                                "ПОДУЯНЕ РАЗПР.СР.Р.","ПОЛИКРАИЩЕ","ПОЛСКИ СЕНОВЕЦ","ПОЛСКИ ТРЪМБЕШ","ПОЛСКО КОСОВО","ПОПОВИЦА",
                                "ПОПОВО","ПОРДИМ","ПРАВДА","ПРЕКОЛНИЦА","ПРЕСЛАВЕЦ","ПРИБОЙ","ПРИЛЕП","ПРОВАДИЯ","ПРОЛЕТ","ПРОСЛАВ",
                                "ПРОСТОРНО","ПТИЧАР","ПЪРВОМАЙ", "РАВНА","РАВНЕЦ","РАВНО ПОЛЕ","РАДАНОВО","РАДЕВЦИ","РАДКО ДИМИТРИЕВ",
                                "РАДОВЕНЕ","РАДОМИР","РАДУЙ","РАДУНЦИ","РАЖДАВИЦА","РАЗГРАД","РАЗДЕЛНА","РАЗЛОГ","РАЗМЕННА","РАЗМЕННА - СП.",
                                "РАКЕВО","РАКОВСКИ","РЕБРОВО","РЕБЪРКОВО","РЕСЕЛЕЦ - СП.","РЕСЕН","РОГОЗЧЕ","РОЗИНО","РОМАН","РОМЧА",
                                "РУЙНО","РУПИТЕ","РУПЦИ - СЕВЕР","РУСАЛЯ ДИЧИН","РУСЕ","РУСЕ РАЗПРЕДЕЛИТЕЛНА","РУСЕ ТОВАРНА-СП.",
                                "РУСКА БЯЛА","САДОВО","САМОВОДЕНЕ","САМУИЛ","САМУИЛОВО","САНДАНСКИ","САРАНЦИ","САХРАНЕ","СБОРИЩЕ",
                                "СВЕЖЕН","СВЕТА ПЕТКА","СВЕТИ ГЕОРГИ","СВЕТЛЕН","СВЕТЛИНА - СП.","СВЕТОВРАЧАНЕ","СВИЛЕНГРАД",
                                "СВИЩОВ","СВОБОДА","СВОГЕ","СЕЛИМИНОВО","СЕНОВО","СЕПТЕМВРИ","СЕСТРИМО","СИЛИСТРА","СИМЕОНОВГРАД",
                                "СИМИТЛИ","СИНАГОВЦИ-ГУРКОВО","СИНДЕЛ РАЗПРЕДЕЛИТ.","СИНИТОВО","СИНЬО БЪРДО","СКАКАВИЦА","СКОБЕЛЕВО",
                                "СКОМЛЯ (КАНТОН-43)","СКУТАРЕ","СЛАВЯНОВО","СЛАНА БАРА","СЛИВЕН","СЛИВНИЦА","СЛИВНИЦА - СП.","СМИЛЕЦ",
                                "СМИРНЕНСКИ","СМОЛЕВО","СМЯДОВО","СОВОЛЯНО","СОКОЛОВО","СОЛНА МИНА","СОМОВИТ","СОПОТ","СОФИЯ","СОФИЯ СЕВЕР",
                                "СПАСОВО","СРАЦИМИР","СРЕДНА АРДА","СТАЙНОВЦИ","СТАЛЕВО","СТАЛИЙСКА МАХАЛА","СТАМБОЛИЙСКИ","СТАМБОЛОВО",
                                "СТАМО КОСТОВ","СТАРА ЗАГОРА","СТАРА КРЕСНА","СТОЙЧЕВЦИ","СТОЛНИК","СТРАЖИЦА","СТРАЛДЖА","СТРАШИМИРОВО",
                                "СТРЕЛЧА","СТРОИТЕЛ","СТРУМЯНИ","СТРУПЕЦ","СТРУЯ","СТРЯМА","СТЪРМЕН","СУВОРОВО","СЪБОТКОВЦИ","СЪЕДИНЕНИЕ",
                                "ТАБАЧКА","ТАНЮ ВОЙВОДА","ТВЪРДИЦА","ТЕЛИШ","ТОДОР КАБЛЕШКОВ","ТОДОРОВО","ТОМПСЪН","ТОПОЛИТЕ","ТОПОЛИЦА",
                                "ТОПОЛОВ ДОЛ","ТРАЙКОВО","ТРАКИЯ","ТРАКИЯ (ШУМЕН)","ТРАПЕЗИЦА","ТРОЯН","ТРУД","ТРЪСТИКОВО","ТРЯВНА",
                                "ТУЛОВО","ТЪЖА","ТЪРГОВИЩЕ","ТЪРНАК","ТЪРНИЧАНИ","УЗУНДЖОВО","УМАРЕВЦИ","УСОЙКА","ФИЛИПОВО","ХАДЖИЕВО",
                                "ХАН АСПАРУХ","ХАН КРУМ","ХАРМАНЛИ","ХАСКОВО","ХЕРАКОВО","ХИСАР","ХИТРИНО","ХЛЕВЕНЕ","ХРАБЪРСКО",
                                "ХРИСТИЯНОВО","ХРИСТО ДАНОВО","ХУМАТА","ХЪРСОВО","ЦАР АСЕН","ЦАРАЦОВО","ЦАРЕВА ЛИВАДА","ЦАРЕВА ПОЛЯНА",
                                "ЦАРЕВЦИ","ЦВЕТИНО","ЦЕПИНА","ЦЕРКОВСКИ","ЦЕРОВИЦА","ЦЕРОВО","ЧАВДАРЦИ","ЧЕКАНЧЕВО","ЧЕЛОПЕЧ","ЧЕРВЕН БРЯГ",
                                "ЧЕРВЕНА","ЧЕРВЕНА ВОДА","ЧЕРГАНОВО","ЧЕРЕПИШ","ЧЕРКВИЦА","ЧЕРНА ГОРА","ЧЕРНА МЕСТА","ЧЕРНЕВО","ЧЕРНИК",
                                "ЧЕРНИЧЕ","ЧЕРНИЧЕВО","ЧЕРНОГОРОВО","ЧЕРНОГРАД","ЧЕРНОЗЕМ","ЧЕСТОВО-СП.","ЧЕШНИГИРОВО","ЧИНТУЛОВО",
                                "ЧИРПАН","ЧИФЛИК","ЧУКОВЕЦ","ЧУМЕРНА","ШИВАЧЕВО","ШИРОКО ПОЛЕ","ШИШКОВЦИ","ШУМЕН","ЮНАК","ЮРУКОВО",
                                "ЯБЪЛКОВО","ЯВОРОВЕЦ","ЯГОДА","ЯГОДОВО","ЯКОРУДА","ЯМБОЛ","ЯНА","ЯНТРА","ЯСЕН","ЯСЕНОВЕЦ","ЯСТРЕБОВО",
                                "ЯХИНОВО"};
        private LocalDBManager() { }

        public static LocalDBManager Instance
        {
            get { return manager; }
        }

        public  async Task Initialize()
        {
            List<Town> townList = new List<Town>();
            db = new SQLiteAsyncConnection("Bdz.db");
            await db.CreateTableAsync<Town>();
            var towns = await this.RetrieveTownTable();
            if (towns.Count == 0)
            {
                var townsRange = this.AddTownsToList();
                int a = 7;
                await this.AddRange(townsRange);
            }
        }

        public  async Task AddRange<T>(List<T> range)
        {
            int x =  await db.InsertAllAsync(range);
            int s = 4;
        }

        public async Task<List<Town>> RetrieveTownTable()
        {
            var query = db.Table<Town>();
            var result = await query.ToListAsync();
            return result;
        }

        private List<Town> AddTownsToList()
        {
            List<Town> townList = new List<Town>();
            for (int i = 0; i < this.towns.Count; i++)
            {
                var Town = new Town()
                {
                    Name = this.towns[i],
                    
                };

                townList.Add(Town);
            }

            return townList;
        }
    }
}